MARS-engineers/arduino-robotrix/hardware/rp2040/boards.txt
RoverOneV1.menu.uploadmethod.default=Default (UF2)
RoverOneV1.menu.uploadmethod.default.build.ram_length=256k
RoverOneV1.menu.uploadmethod.default.build.debugscript=picoprobe_cmsis_dap.tcl
RoverOneV1.menu.uploadmethod.default.upload.maximum_data_size=262144
RoverOneV1.menu.uploadmethod.default.upload.tool=uf2conv
RoverOneV1.menu.uploadmethod.default.upload.tool.default=uf2conv
RoverOneV1.menu.uploadmethod.default.upload.tool.network=uf2conv-network
RoverOneV1.menu.uploadmethod.picotool=Picotool
RoverOneV1.menu.uploadmethod.picotool.build.ram_length=256k
RoverOneV1.menu.uploadmethod.picotool.build.debugscript=picoprobe.tcl
RoverOneV1.menu.uploadmethod.picotool.build.picodebugflags=-DENABLE_PICOTOOL_USB
RoverOneV1.menu.uploadmethod.picotool.upload.maximum_data_size=262144
RoverOneV1.menu.uploadmethod.picotool.upload.tool=picotool
RoverOneV1.menu.uploadmethod.picotool.upload.tool.default=picotool
RoverOneV1.menu.uploadmethod.picoprobe_cmsis_dap=Picoprobe/Debugprobe (CMSIS-DAP)
RoverOneV1.menu.uploadmethod.picoprobe_cmsis_dap.build.ram_length=256k
RoverOneV1.menu.uploadmethod.picoprobe_cmsis_dap.build.debugscript=picoprobe_cmsis_dap.tcl
RoverOneV1.menu.uploadmethod.picoprobe_cmsis_dap.upload.maximum_data_size=262144
RoverOneV1.menu.uploadmethod.picoprobe_cmsis_dap.upload.tool=picoprobe_cmsis_dap
RoverOneV1.menu.uploadmethod.picoprobe_cmsis_dap.upload.tool.default=picoprobe_cmsis_dap

# -----------------------------------
# Robotix Rover One V2
# -----------------------------------
RoverOneV2.name=Robotix Rover One V2
RoverOneV2.vid.0=0x2e8a
RoverOneV2.pid.0=0xf00f
RoverOneV2.vid.1=0x2e8a
RoverOneV2.pid.1=0xf10f
RoverOneV2.upload_port.0.vid=0x2e8a
RoverOneV2.upload_port.0.pid=0xf00f
RoverOneV2.upload_port.1.vid=0x2e8a
RoverOneV2.upload_port.1.pid=0xf10f
RoverOneV2.build.usbvid=-DUSBD_VID=0x2e8a
RoverOneV2.build.usbpid=-DUSBD_PID=0xf00f
RoverOneV2.build.usbpwr=-DUSBD_MAX_POWER_MA=250
RoverOneV2.build.board=GENERIC_RP2350
RoverOneV2.build.variant=RoverOneV2
RoverOneV2.upload.maximum_size=16777216
RoverOneV2.upload.wait_for_upload_port=true
RoverOneV2.upload.erase_cmd=
RoverOneV2.serial.disableDTR=false
RoverOneV2.serial.disableRTS=false
RoverOneV2.build.f_cpu=125000000
RoverOneV2.build.led=
RoverOneV2.build.core=rp2040:rp2040
RoverOneV2.build.ldscript=memmap_default.ld
RoverOneV2.build.boot2=none
RoverOneV2.build.usb_manufacturer="MARS-Engineers"
RoverOneV2.build.usb_product="Robotix Rover One V2"

RoverOneV2.menu.variantchip.RP2530B=RP2530B
RoverOneV2.menu.variantchip.RP2530B.build.variantdefines=-D__PICO_RP2350A=0

RoverOneV2.usbstack.picosdk.build.usbstack_flags=
RoverOneV2.ipbtstack.ipv4only.build.libpicow=liblwip.a
RoverOneV2.ipbtstack.ipv4only.build.libpicowdefs=-DLWIP_IPV6=0 -DLWIP_IPV4=1
RoverOneV2.rtti.Disabled.build.flags.rtti=-fno-rtti
RoverOneV2.menu.stackprotect.Disabled=Disabled
RoverOneV2.menu.stackprotect.Disabled.build.flags.stackprotect=
RoverOneV2.menu.stackprotect.Enabled=Enabled
RoverOneV2.menu.stackprotect.Enabled.build.flags.stackprotect=-fstack-protector-all

RoverOneV2.menu.exceptions.Disabled=Disabled
RoverOneV2.menu.exceptions.Disabled.build.flags.exceptions=-fno-exceptions
RoverOneV2.menu.exceptions.Disabled.build.flags.libstdcpp=-lstdc++
RoverOneV2.menu.exceptions.Enabled=Enabled
RoverOneV2.menu.exceptions.Enabled.build.flags.exceptions=-fexceptions
RoverOneV2.menu.exceptions.Enabled.build.flags.libstdcpp=-lstdc++-exc

RoverOneV2.menu.flash.16777216_0=16MB (no FS)
RoverOneV2.menu.flash.16777216_0.upload.maximum_size=16769024
RoverOneV2.menu.flash.16777216_0.build.flash_total=16777216
RoverOneV2.menu.flash.16777216_0.build.flash_length=16769024
RoverOneV2.menu.flash.16777216_0.build.eeprom_start=285204480
RoverOneV2.menu.flash.16777216_0.build.fs_start=285204480
RoverOneV2.menu.flash.16777216_0.build.fs_end=285204480
RoverOneV2.menu.flash.16777216_15728640=16MB (Sketch: 1MB, FS: 15MB)
RoverOneV2.menu.flash.16777216_15728640.upload.maximum_size=1040384
RoverOneV2.menu.flash.16777216_15728640.build.flash_total=16777216
RoverOneV2.menu.flash.16777216_15728640.build.flash_length=1040384
RoverOneV2.menu.flash.16777216_15728640.build.eeprom_start=285204480
RoverOneV2.menu.flash.16777216_15728640.build.fs_start=269475840
RoverOneV2.menu.flash.16777216_15728640.build.fs_end=285204480
RoverOneV2.menu.flash.16777216_14680064=16MB (Sketch: 2MB, FS: 14MB)
RoverOneV2.menu.flash.16777216_14680064.upload.maximum_size=2088960
RoverOneV2.menu.flash.16777216_14680064.build.flash_total=16777216
RoverOneV2.menu.flash.16777216_14680064.build.flash_length=2088960
RoverOneV2.menu.flash.16777216_14680064.build.eeprom_start=285204480
RoverOneV2.menu.flash.16777216_14680064.build.fs_start=270524416
RoverOneV2.menu.flash.16777216_14680064.build.fs_end=285204480
RoverOneV2.menu.flash.16777216_12582912=16MB (Sketch: 4MB, FS: 12MB)
RoverOneV2.menu.flash.16777216_12582912.upload.maximum_size=4186112
RoverOneV2.menu.flash.16777216_12582912.build.flash_total=16777216
RoverOneV2.menu.flash.16777216_12582912.build.flash_length=4186112
RoverOneV2.menu.flash.16777216_12582912.build.eeprom_start=285204480
RoverOneV2.menu.flash.16777216_12582912.build.fs_start=272621568
RoverOneV2.menu.flash.16777216_12582912.build.fs_end=285204480
RoverOneV2.menu.flash.16777216_8388608=16MB (Sketch: 8MB, FS: 8MB)
RoverOneV2.menu.flash.16777216_8388608.upload.maximum_size=8380416
RoverOneV2.menu.flash.16777216_8388608.build.flash_total=16777216
RoverOneV2.menu.flash.16777216_8388608.build.flash_length=8380416
RoverOneV2.menu.flash.16777216_8388608.build.eeprom_start=285204480
RoverOneV2.menu.flash.16777216_8388608.build.fs_start=276815872
RoverOneV2.menu.flash.16777216_8388608.build.fs_end=285204480
RoverOneV2.menu.flash.16777216_4194304=16MB (Sketch: 12MB, FS: 4MB)
RoverOneV2.menu.flash.16777216_4194304.upload.maximum_size=12574720
RoverOneV2.menu.flash.16777216_4194304.build.flash_total=16777216
RoverOneV2.menu.flash.16777216_4194304.build.flash_length=12574720
RoverOneV2.menu.flash.16777216_4194304.build.eeprom_start=285204480
RoverOneV2.menu.flash.16777216_4194304.build.fs_start=281010176
RoverOneV2.menu.flash.16777216_4194304.build.fs_end=285204480
RoverOneV2.menu.flash.16777216_2097152=16MB (Sketch: 14MB, FS: 2MB)
RoverOneV2.menu.flash.16777216_2097152.upload.maximum_size=14671872
RoverOneV2.menu.flash.16777216_2097152.build.flash_total=16777216
RoverOneV2.menu.flash.16777216_2097152.build.flash_length=14671872
RoverOneV2.menu.flash.16777216_2097152.build.eeprom_start=285204480
RoverOneV2.menu.flash.16777216_2097152.build.fs_start=283107328
RoverOneV2.menu.flash.16777216_2097152.build.fs_end=285204480
RoverOneV2.menu.arch.arm=ARM
RoverOneV2.menu.arch.arm.build.chip=rp2350
RoverOneV2.menu.arch.arm.build.toolchain=arm-none-eabi
RoverOneV2.menu.arch.arm.build.toolchainpkg=pqt-gcc
RoverOneV2.menu.arch.arm.build.toolchainopts=-mcpu=cortex-m33 -mthumb -march=armv8-m.main+fp+dsp -mfloat-abi=softfp -mcmse
RoverOneV2.menu.arch.arm.build.uf2family=--family rp2350-arm-s --abs-block
RoverOneV2.menu.arch.arm.build.mcu=cortex-m33
RoverOneV2.menu.arch.riscv=RISC-V
RoverOneV2.menu.arch.riscv.build.chip=rp2350-riscv
RoverOneV2.menu.arch.riscv.build.toolchain=riscv32-unknown-elf
RoverOneV2.menu.arch.riscv.build.toolchainpkg=pqt-gcc-riscv
RoverOneV2.menu.arch.riscv.build.toolchainopts=-march=rv32imac_zicsr_zifencei_zba_zbb_zbs_zbkb -mabi=ilp32
RoverOneV2.menu.arch.riscv.build.uf2family=--family rp2350-riscv --abs-block
RoverOneV2.menu.arch.riscv.build.mcu=rv32imac
RoverOneV2.menu.freq.150=150 MHz
RoverOneV2.menu.freq.150.build.f_cpu=150000000L
RoverOneV2.menu.freq.50=50 MHz
RoverOneV2.menu.freq.50.build.f_cpu=50000000L
RoverOneV2.menu.freq.100=100 MHz
RoverOneV2.menu.freq.100.build.f_cpu=100000000L
RoverOneV2.menu.freq.120=120 MHz
RoverOneV2.menu.freq.120.build.f_cpu=120000000L
RoverOneV2.menu.freq.125=125 MHz
RoverOneV2.menu.freq.125.build.f_cpu=125000000L
RoverOneV2.menu.freq.128=128 MHz
RoverOneV2.menu.freq.128.build.f_cpu=128000000L
RoverOneV2.menu.freq.133=133 MHz
RoverOneV2.menu.freq.133.build.f_cpu=133000000L
RoverOneV2.menu.freq.176=176 MHz (Overclock)
RoverOneV2.menu.freq.176.build.f_cpu=176000000L
RoverOneV2.menu.freq.200=200 MHz (Overclock)
RoverOneV2.menu.freq.200.build.f_cpu=200000000L
RoverOneV2.menu.freq.225=225 MHz (Overclock)
RoverOneV2.menu.freq.225.build.f_cpu=225000000L
RoverOneV2.menu.freq.240=240 MHz (Overclock)
RoverOneV2.menu.freq.240.build.f_cpu=240000000L
RoverOneV2.menu.freq.250=250 MHz (Overclock)
RoverOneV2.menu.freq.250.build.f_cpu=250000000L
RoverOneV2.menu.freq.276=276 MHz (Overclock)
RoverOneV2.menu.freq.276.build.f_cpu=276000000L
RoverOneV2.menu.freq.300=300 MHz (Overclock)
RoverOneV2.menu.freq.300.build.f_cpu=300000000L

RoverOneV2.menu.psramcs.GPIOnone=None
RoverOneV2.menu.psramcs.GPIOnone.build.psram_cs=
RoverOneV2.menu.psramcs.GPIO0=GPIO 0
RoverOneV2.menu.psramcs.GPIO0.build.psram_cs=-DRP2350_PSRAM_CS=0
RoverOneV2.menu.psram.0mb=0MByte PSRAM
RoverOneV2.menu.psram.0mb.build.psram_length=0x000000
RoverOneV2.menu.psram.2mb=2MByte PSRAM
RoverOneV2.menu.psram.2mb.build.psram_length=0x200000
RoverOneV2.menu.psram.4mb=4MByte PSRAM
RoverOneV2.menu.psram.4mb.build.psram_length=0x400000
RoverOneV2.menu.psram.8mb=8MByte PSRAM
RoverOneV2.menu.psram.8mb.build.psram_length=0x800000
RoverOneV2.menu.psramfreq.freq109=109 MHz
RoverOneV2.menu.psramfreq.freq109.build.psram_freq=-DRP2350_PSRAM_MAX_SCK_HZ=109000000
RoverOneV2.menu.psramfreq.freq133=133 MHz
RoverOneV2.menu.psramfreq.freq133.build.psram_freq=-DRP2350_PSRAM_MAX_SCK_HZ=133000000
RoverOneV2.menu.opt.Small=Small (-Os) (standard)
RoverOneV2.menu.opt.Small.build.flags.optimize=-Os
RoverOneV2.menu.opt.Optimize=Optimize (-O)
RoverOneV2.menu.opt.Optimize.build.flags.optimize=-O
RoverOneV2.menu.opt.Optimize2=Optimize More (-O2)
RoverOneV2.menu.opt.Optimize2.build.flags.optimize=-O2
RoverOneV2.menu.opt.Optimize3=Optimize Even More (-O3)
RoverOneV2.menu.opt.Optimize3.build.flags.optimize=-O3
RoverOneV2.menu.opt.Fast=Fast (-Ofast) (maybe slower)
RoverOneV2.menu.opt.Fast.build.flags.optimize=-Ofast
RoverOneV2.menu.opt.Debug=Debug (-Og)
RoverOneV2.menu.opt.Debug.build.flags.optimize=-Og
RoverOneV2.menu.opt.Disabled=Disabled (-O0)
RoverOneV2.menu.opt.Disabled.build.flags.optimize=-O0
RoverOneV2.menu.os.none=None
RoverOneV2.menu.os.none.build.os=
RoverOneV2.menu.os.freertos=FreeRTOS SMP
RoverOneV2.menu.os.freertos.build.os=-D__FREERTOS
RoverOneV2.menu.profile.Disabled=Disabled
RoverOneV2.menu.profile.Disabled.build.flags.profile=
RoverOneV2.menu.profile.Enabled=Enabled
RoverOneV2.menu.profile.Enabled.build.flags.profile=-pg -D__PROFILE

RoverOneV2.menu.dbgport.Disabled=Disabled
RoverOneV2.menu.dbgport.Disabled.build.debug_port=
RoverOneV2.menu.dbgport.Serial=Serial
RoverOneV2.menu.dbgport.Serial.build.debug_port=-DDEBUG_RP2040_PORT=Serial
RoverOneV2.menu.dbgport.Serial1=Serial1
RoverOneV2.menu.dbgport.Serial1.build.debug_port=-DDEBUG_RP2040_PORT=Serial1

RoverOneV2.menu.dbglvl.None=None
RoverOneV2.menu.dbglvl.None.build.debug_level=
RoverOneV2.menu.dbglvl.Core=Core
RoverOneV2.menu.dbglvl.Core.build.debug_level=-DDEBUG_RP2040_CORE
RoverOneV2.menu.dbglvl.SPI=SPI
RoverOneV2.menu.dbglvl.SPI.build.debug_level=-DDEBUG_RP2040_SPI
RoverOneV2.menu.dbglvl.Wire=Wire
RoverOneV2.menu.dbglvl.Wire.build.debug_level=-DDEBUG_RP2040_WIRE
RoverOneV2.menu.dbglvl.Bluetooth=Bluetooth
RoverOneV2.menu.dbglvl.Bluetooth.build.debug_level=-DDEBUG_RP2040_BLUETOOTH
RoverOneV2.menu.dbglvl.LWIP=LWIP
RoverOneV2.menu.dbglvl.LWIP.build.debug_level=-DLWIP_DEBUG=1
RoverOneV2.menu.dbglvl.All=All
RoverOneV2.menu.dbglvl.All.build.debug_level=-DDEBUG_RP2040_WIRE -DDEBUG_RP2040_SPI -DDEBUG_RP2040_CORE -DDEBUG_RP2040_BLUETOOTH -DLWIP_DEBUG=1
RoverOneV2.menu.dbglvl.NDEBUG=NDEBUG
RoverOneV2.menu.dbglvl.NDEBUG.build.debug_level=-DNDEBUG

RoverOneV2.menu.uploadmethod.default=Default (UF2)
RoverOneV2.menu.uploadmethod.default.build.ram_length=512k
RoverOneV2.menu.uploadmethod.default.build.debugscript=picoprobe_cmsis_dap.tcl
RoverOneV2.menu.uploadmethod.default.upload.maximum_data_size=524288
RoverOneV2.menu.uploadmethod.default.upload.tool=uf2conv
RoverOneV2.menu.uploadmethod.default.upload.tool.default=uf2conv
RoverOneV2.menu.uploadmethod.default.upload.tool.network=uf2conv-network
RoverOneV2.menu.uploadmethod.picotool=Picotool
RoverOneV2.menu.uploadmethod.picotool.build.ram_length=512k
RoverOneV2.menu.uploadmethod.picotool.build.debugscript=picoprobe.tcl
RoverOneV2.menu.uploadmethod.picotool.build.picodebugflags=-DENABLE_PICOTOOL_USB
RoverOneV2.menu.uploadmethod.picotool.upload.maximum_data_size=524288
RoverOneV2.menu.uploadmethod.picotool.upload.tool=picotool
RoverOneV2.menu.uploadmethod.picotool.upload.tool.default=picotool
RoverOneV2.menu.uploadmethod.picoprobe_cmsis_dap=Picoprobe/Debugprobe (CMSIS-DAP)
RoverOneV2.menu.uploadmethod.picoprobe_cmsis_dap.build.ram_length=512k
RoverOneV2.menu.uploadmethod.picoprobe_cmsis_dap.build.debugscript=picoprobe_cmsis_dap.tcl
RoverOneV2.menu.uploadmethod.picoprobe_cmsis_dap.upload.maximum_data_size=524288
RoverOneV2.menu.uploadmethod.picoprobe_cmsis_dap.upload.tool=picoprobe_cmsis_dap
RoverOneV2.menu.uploadmethod.picoprobe_cmsis_dap.upload.tool.default=picoprobe_cmsis_dap